In [1]:
import pandas as pd
import numpy as np

In [2]:
#Hay hasta operaciones como SQL

In [3]:
#contruyendo una serie
#primero se necesitaran los datos 
data = [ 5, 7, 9, 25, 19]

In [4]:
#Si quisieramos especificar el tipo de dato, es posible, 
series1 = pd.Series(data)
pd.Series(data)

0     5
1     7
2     9
3    25
4    19
dtype: int64

In [67]:
type(series1)
series1[2]

9

In [6]:
#Podemos crear nuestros propios indices 
Indices = ['A', 'B', 'C', 'D', 'E']
series1 = pd.Series(data, Indices)
series1

A     5
B     7
C     9
D    25
E    19
dtype: int64

In [7]:
series1['B']

7

In [8]:
series1['E']

19

In [9]:
series1[['B','A']]

B    7
A    5
dtype: int64

In [10]:
series1[series1>10]
#vemos como podemos usar muchos conceptos de Numpy porque esta basanda en esta libreria

D    25
E    19
dtype: int64

In [68]:
#importante saber que tampoco se pierde el indice numerico
series1[2]

9

In [69]:
#Aqui podemos ver que hay mucha variedad de operaciones posibles
print(series1[series1>3].min())
print(series1[series1>3].max())
print(series1[series1>3].sum())
print(series1[series1>3].mean())
#...

5
25
65
13.0

In [13]:
#tambien pueden venir mis datos de un arreglo de Numpy
data = np.array([ 5, 7, 9, 25, 19])
Indices = ['A', 'B', 'C', 'D', 'E']
series2 = pd.Series(data = data, index = Indices)#asignacion por nombre
#usualmente nosotros asignamos parametros a una funcion en base a la posicion pero python permite que sea por nombre
series2

A     5
B     7
C     9
D    25
E    19
dtype: int32

In [14]:
dic = {'A':1,'B':2,'C':88,'D':16,'E':45 }
pd.Series(dic) #tambien se puede usar un diccionario

A     1
B     2
C    88
D    16
E    45
dtype: int64

In [15]:
#usualmente se usaran mas dataframes que son conocidas mas como las tablas de excel
np.random.seed(101)
np.random.randn(5)
pd.DataFrame(np.random.randn(5,4))

          0         1         2         3
0 -0.319318 -0.848077  0.605965 -2.018168
1  0.740122  0.528813 -0.589001  0.188695
2 -0.758872 -0.933237  0.955057  0.190794
3  1.978757  2.605967  0.683509  0.302665
4  1.693723 -1.706086 -1.159119 -0.134841

In [16]:
pd.DataFrame(np.random.randn(5,4), index = ['MX', 'EN','FR', 'CH', 'ES'])

           0         1         2         3
MX  0.390528  0.166905  0.184502  0.807706
EN  0.072960  0.638787  0.329646 -0.497104
FR -0.754070 -0.943406  0.484752 -0.116773
CH  1.901755  0.238127  1.996652 -0.993263
ES  0.196800 -1.136645  0.000366  1.025984

In [17]:
df = pd.DataFrame(np.random.randn(5,4), index = ['MX', 'EN','FR', 'CH', 'ES'], columns =['A','B','C','D'])
df

           A         B         C         D
MX -0.156598 -0.031579  0.649826  2.154846
EN -0.610259 -0.755325 -0.346419  0.147027
FR -0.479448  0.558769  1.024810 -0.925874
CH  1.862864 -1.133817  0.610478  0.386030
ES  2.084019 -0.376519  0.230336  0.681209

In [18]:
df['A']

MX   -0.156598
EN   -0.610259
FR   -0.479448
CH    1.862864
ES    2.084019
Name: A, dtype: float64

In [19]:
df[['A', 'C']]

           A         C
MX -0.156598  0.649826
EN -0.610259 -0.346419
FR -0.479448  1.024810
CH  1.862864  0.610478
ES  2.084019  0.230336

In [20]:
df.loc['MX']

A   -0.156598
B   -0.031579
C    0.649826
D    2.154846
Name: MX, dtype: float64

In [21]:
df.loc[['MX', 'FR']]

           A         B         C         D
MX -0.156598 -0.031579  0.649826  2.154846
FR -0.479448  0.558769  1.024810 -0.925874

In [22]:
df[['A', 'B']].loc[['MX', 'FR']]

           A         B
MX -0.156598 -0.031579
FR -0.479448  0.558769

In [23]:
df[['A', 'B']].loc[['MX', 'FR']]=0

C:\Users\Yumil\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)
C:\Users\Yumil\anaconda3\lib\site-packages\pandas\core\indexing.py:723: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value, self.name)

In [72]:
df[['A', 'B']]=0
df

    W     X     Y     Z   SUM  A  B
A  44  44.0  44.0  44.0  44.0  0  0
B  44  44.0  44.0  44.0  44.0  0  0
C  44  44.0  44.0  44.0  44.0  0  0
D  44  44.0  44.0  44.0  44.0  0  0

In [78]:
df = pd.DataFrame(np.random.randn(5,4), index = ['MX', 'EN','FR', 'CH', 'ES'], columns =['A','B','C','D'])
df

           A         B         C         D
MX  0.302665  1.693723 -1.706086 -1.159119
EN -0.134841  0.390528  0.166905  0.184502
FR  0.807706  0.072960  0.638787  0.329646
CH -0.497104 -0.754070 -0.943406  0.484752
ES -0.116773  1.901755  0.238127  1.996652

In [27]:
df['A'] + df['B']

MX    1.003965
EN   -0.554665
FR    2.443954
CH    0.145461
ES   -0.656630
dtype: float64

In [81]:
df['PROC'] = df['A'] + df['B']+ df['C'] + df['D'] 
df #agregamos nuevas columnas

           A         B         C         D      PROC
MX  0.302665  1.693723 -1.706086 -1.159119 -0.868817
EN -0.134841  0.390528  0.166905  0.184502  0.607094
FR  0.807706  0.072960  0.638787  0.329646  1.849099
CH -0.497104 -0.754070 -0.943406  0.484752 -1.709828
ES -0.116773  1.901755  0.238127  1.996652  4.019761

In [29]:
df.drop('PROC', axis = 1) #axis = 1 columnas, cero es para filas

           A         B         C         D
MX  1.035125 -0.031160  1.939932 -1.005187
EN -0.741790  0.187125 -0.732845 -1.382920
FR  1.482495  0.961458 -2.141212  0.992573
CH  1.192241 -1.046780  1.292765 -1.467514
ES -0.494095 -0.162535  0.485809  0.392489

In [30]:
#aqui vemos algo raro, se supone que lo hab√≠a borrado, pero lo que pasa e sque no simepre se borra de la lista original
#sino que solo lo borra de una copia.
df

           A         B         C         D      PROC
MX  1.035125 -0.031160  1.939932 -1.005187  1.003965
EN -0.741790  0.187125 -0.732845 -1.382920 -0.554665
FR  1.482495  0.961458 -2.141212  0.992573  2.443954
CH  1.192241 -1.046780  1.292765 -1.467514  0.145461
ES -0.494095 -0.162535  0.485809  0.392489 -0.656630

In [32]:
df.drop('PROC', axis = 1, inplace = True)

In [33]:
df

           A         B         C         D
MX  1.035125 -0.031160  1.939932 -1.005187
EN -0.741790  0.187125 -0.732845 -1.382920
FR  1.482495  0.961458 -2.141212  0.992573
CH  1.192241 -1.046780  1.292765 -1.467514
ES -0.494095 -0.162535  0.485809  0.392489

In [34]:
df.drop('MX', axis = 0) #Borramos en una copia la fila

           A         B         C         D
EN -0.741790  0.187125 -0.732845 -1.382920
FR  1.482495  0.961458 -2.141212  0.992573
CH  1.192241 -1.046780  1.292765 -1.467514
ES -0.494095 -0.162535  0.485809  0.392489

In [35]:
df

           A         B         C         D
MX  1.035125 -0.031160  1.939932 -1.005187
EN -0.741790  0.187125 -0.732845 -1.382920
FR  1.482495  0.961458 -2.141212  0.992573
CH  1.192241 -1.046780  1.292765 -1.467514
ES -0.494095 -0.162535  0.485809  0.392489

In [36]:
df.reset_index()

  index         A         B         C         D
0    MX  1.035125 -0.031160  1.939932 -1.005187
1    EN -0.741790  0.187125 -0.732845 -1.382920
2    FR  1.482495  0.961458 -2.141212  0.992573
3    CH  1.192241 -1.046780  1.292765 -1.467514
4    ES -0.494095 -0.162535  0.485809  0.392489

In [37]:
df

           A         B         C         D
MX  1.035125 -0.031160  1.939932 -1.005187
EN -0.741790  0.187125 -0.732845 -1.382920
FR  1.482495  0.961458 -2.141212  0.992573
CH  1.192241 -1.046780  1.292765 -1.467514
ES -0.494095 -0.162535  0.485809  0.392489

In [82]:
df['New_index'] = df['index'] + "2"

KeyError: 'index'

In [39]:
df.reset_index(inplace = True)

In [40]:
df['New_index'] = df['index'] + "2"

In [41]:
df

  index         A         B         C         D New_index
0    MX  1.035125 -0.031160  1.939932 -1.005187       MX2
1    EN -0.741790  0.187125 -0.732845 -1.382920       EN2
2    FR  1.482495  0.961458 -2.141212  0.992573       FR2
3    CH  1.192241 -1.046780  1.292765 -1.467514       CH2
4    ES -0.494095 -0.162535  0.485809  0.392489       ES2

In [43]:
df.set_index('New_index', inplace = True)
df.drop('index', axis = 1, inplace = True)
df

                  A         B         C         D
New_index
MX2        1.035125 -0.031160  1.939932 -1.005187
EN2       -0.741790  0.187125 -0.732845 -1.382920
FR2        1.482495  0.961458 -2.141212  0.992573
CH2        1.192241 -1.046780  1.292765 -1.467514
ES2       -0.494095 -0.162535  0.485809  0.392489

In [44]:
df > 0

               A      B      C      D
New_index
MX2         True  False   True  False
EN2        False   True  False  False
FR2         True   True  False   True
CH2         True  False   True  False
ES2        False  False   True   True

In [45]:
df [df>0]

                  A         B         C         D
New_index
MX2        1.035125       NaN  1.939932       NaN
EN2             NaN  0.187125       NaN       NaN
FR2        1.482495  0.961458       NaN  0.992573
CH2        1.192241       NaN  1.292765       NaN
ES2             NaN       NaN  0.485809  0.392489

In [47]:
df [df>0] = 0
df

                  A         B         C         D
New_index
MX2        0.000000 -0.031160  0.000000 -1.005187
EN2       -0.741790  0.000000 -0.732845 -1.382920
FR2        0.000000  0.000000 -2.141212  0.000000
CH2        0.000000 -1.046780  0.000000 -1.467514
ES2       -0.494095 -0.162535  0.000000  0.000000

In [49]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(5,4), index = ['MX', 'EN','FR', 'CH', 'ES'], columns =['A','B','C','D'])
df

           A         B         C         D
MX  2.706850  0.628133  0.907969  0.503826
EN  0.651118 -0.319318 -0.848077  0.605965
FR -2.018168  0.740122  0.528813 -0.589001
CH  0.188695 -0.758872 -0.933237  0.955057
ES  0.190794  1.978757  2.605967  0.683509

In [50]:
df > 0

        A      B      C      D
MX   True   True   True   True
EN   True  False  False   True
FR  False   True   True  False
CH   True  False  False   True
ES   True   True   True   True

In [52]:
df[df['A']>0] #pon las filas donde A sea positivo, en este caso todas

           A         B         C         D
MX  2.706850  0.628133  0.907969  0.503826
EN  0.651118 -0.319318 -0.848077  0.605965
CH  0.188695 -0.758872 -0.933237  0.955057
ES  0.190794  1.978757  2.605967  0.683509

In [54]:
df[(df['A']>0)& (df['C']>0)]

           A         B         C         D
MX  2.706850  0.628133  0.907969  0.503826
ES  0.190794  1.978757  2.605967  0.683509

# Leer archivos CSV

In [55]:
#Cargar un archivo CSV, EXCEL
#pero podriamos usar ya bases de datos ya hechas

In [83]:
df =pd.read_csv('Prueba.csv')
df

   W     X     Y    Z
0  5  2.50  4.70  0.0
1  3  0.36  2.58  0.0
2 -1  5.20  8.78  7.0
3  4  0.00  3.20  7.4

In [84]:
df.to_csv("Prueba_mod.csv")
df

   W     X     Y    Z
0  5  2.50  4.70  0.0
1  3  0.36  2.58  0.0
2 -1  5.20  8.78  7.0
3  4  0.00  3.20  7.4

In [85]:
df.to_csv("Prueba_mod.csv", index = False) #siempre le tienes que poner el .csv
df

   W     X     Y    Z
0  5  2.50  4.70  0.0
1  3  0.36  2.58  0.0
2 -1  5.20  8.78  7.0
3  4  0.00  3.20  7.4

In [90]:
df = pd.read_csv('Prueba2.csv', index_col = 0) #borramos mi indice
df

   W     X     Y    Z
A  5  2.50  4.70  0.0
B  3  0.36  2.58  0.0
C -1  5.20  8.78  7.0
D  4  0.00  3.20  7.4

In [91]:
df['SUM'] = df.sum(axis= 1)
df

   W     X     Y    Z    SUM
A  5  2.50  4.70  0.0  12.20
B  3  0.36  2.58  0.0   5.94
C -1  5.20  8.78  7.0  19.98
D  4  0.00  3.20  7.4  14.60

In [92]:
df.to_csv("Prueba2_mod.csv")
df

   W     X     Y    Z    SUM
A  5  2.50  4.70  0.0  12.20
B  3  0.36  2.58  0.0   5.94
C -1  5.20  8.78  7.0  19.98
D  4  0.00  3.20  7.4  14.60

In [98]:
df >0

       W      X     Y      Z   SUM
A   True   True  True  False  True
B   True   True  True  False  True
C  False   True  True   True  True
D   True  False  True   True  True

In [108]:
df[df['W']>0]

   W     X     Y    Z    SUM
A  5  2.50  4.70  0.0  12.20
B  3  0.36  2.58  0.0   5.94
D  4  0.00  3.20  7.4  14.60